[
  {
    "company": "H5mag",
    "type": "Job",
    "role": "Full-Stack Developer",
    "shortDescription": "Developed a feedback module that empowers users to create custom forms with dynamic questions.",
    "description": [
      "Developed a user-friendly feedback module enabling customization of forms with dynamic questions, which allows publications gather information about their readers.",
      "Created and implemented the module from scratch using PHP, JavaScript, SQLite, and MariaDB, ensuring efficient data storage with individual SQLite databases for each form.",
      "Built the H5mag Zapier app, widely adopted by multiple users, simplifying workflows by allowing custom actions upon question submissions.",
      "Maintained and documented API endpoints to ensure system stability and smooth integration, contributing to an enhanced user experience.",
      "Authored documentation for internal teams and user-friendly guides, reducing support and onboarding time.",
      "Improved the feedback module based on real user feedback, demonstrating responsiveness to evolving user needs.",
      "Collaborated with designers and engineers to enhance the user experience and maintain adherence to established code standards.",
      "Provided direct customer support, addressing queries and issues promptly."
    ],
    "period": [
      "2020-09-01",
      "2023-04-01"
    ],
    "url": "https://www.h5mag.com",
    "technologies": [
      "PHP",
      "JS",
      "MariaDB",
      "SQLite",
      "GIT",
      "GitLab",
      "Linux",
      "Zapier CLI",
      "Node.js"
    ]
  },
  {
    "company": "Squeezely",
    "type": "Job",
    "role": "Intern Back-end Engineer",
    "shortDescription": "Developed a plugin to streamline the integration process with Squeezely, a Customer Data Platform.",
    "description": [
      "Developed product integrations for Shopify, Magento 2, and Lightspeed, catering to companies managing extensive inventories exceeding 10000 products.",
      "Collaborated with internal teams, including marketeers to improve the onboarding process for various platform integrations."
    ],
    "period": [
      1567299600,
      1580518800
    ],
    "url": "https://www.squeezely.tech/en",
    "technologies": [
      "Symfony",
      "SQL",
      "JS",
      "Shopify",
      "Magento",
      "Pagespeed"
    ]
  },
  {
    "company": "Innovative Design Delft",
    "type": "Job",
    "role": "Fullstack Developer",
    "shortDescription": "Designed a data retrieval tool to extract articles from different news sites.",
    "description": [
      "Sped up the extracting process by improving the internal database structure.",
      "Designed and provided technical solutions that met the business requirements of stakeholders"
    ],
    "period": [
      1441069200,
      1509498000
    ],
    "url": "https://iidesk.com/",
    "technologies": [
      "SVN",
      "JS",
      "Vanilla PHP",
      "CSS",
      "Bootstrap"
    ]
  }
]
